"""
C. Индекс подмножества
Ограничение времени
2 с
Ограничение памяти
256.0 Мб
Ввод
стандартный ввод
Вывод
стандартный вывод
Рассмотрим множество
1,2,…,n. Любому его подмножеству
S можно поставить в соответствие целое число следующим образом:
мы записываем двоичное число из
n бит;
i-й бит (считая от младшего, справа) равен 1, если число
i входит в подмножество
S, и 0 в противном случае;
получившееся двоичное число рассматриваем как обычное целое число в десятичной системе — это и есть индекс подмножества.
Пример: пусть
n=5 и
S=1,3,5. Тогда биты с номерами 1, 3 и 5 равны 1, остальные — 0.
Двоичное число (от 5-го бита к 1-му): 10101₂, что в десятичной системе даёт 21.

Нужно по заданному
n и подмножеству
S найти:

индекс подмножества
mask — описанным выше способом;
общее число подмножеств множества
1,…,n, то есть 2**n.

Формат входных данных
Первая строка: два целых числа
n и k (0≤n≤60, 0≤k≤n).

Вторая строка (если
k>0): k различных целых чисел по возрастанию из диапазона от
1 до n — элементы подмножества S.

Если
k=0, вторая строка отсутствует (подмножество пусто).

Гарантируется, что входные данные корректны: все элементы
S лежат в диапазоне
[1,n] и идут по возрастанию.

Формат выходных данных
Два целых числа через пробел:

mask — индекс подмножества (десятичное значение числа с описанными выше битами);
total=2
n — общее количество подмножеств множества 1,…,n.
Пример
Ввод
5 3
1 3 5

Вывод
21 32"""

import sys


def main():
    """
    Пример ввода и вывода числа n, где -10^9 < n < 10^9:
    n = int(input())
    print(n)
    """
    n, k = [int(i) for i in input().split()]
    if n * k > 0:
        bits = [int(i) for i in input().split()]
        ind = 0
        for i in bits:
            ind += 2 ** (i - 1)
        total_combs = 2**n
        print(ind, total_combs)
    else:
        print(0, 2**n)


if __name__ == "__main__":
    main()
