"""
C. Проклятие размерности
Ограничение времени
2 с
Ограничение памяти
256.0 Мб
Ввод
стандартный ввод
Вывод
стандартный вывод
Эта задача помогает интуитивно понять «проклятие размерности». В пространствах высокой размерности почти весь объём фигур сосредотачивается у их поверхности.

Рассмотрим
d-мерный единичный гиперкуб (все координаты точек xi лежат в диапазоне
[0,1]).

Мы хотим вычислить объём приграничного слоя толщиной
ε. Точка считается лежащей в этом слое, если она находится близко к любой из границ куба. Формально: точка
x принадлежит слою, если хотя бы одна её координата
xi удовлетворяет условию:
xi≤ε или xi≥1−ε
Вычислите объём этого приграничного слоя. Так как объём всего гиперкуба равен 1, это число также равно доле занимаемого объёма.
Подсказка: попробуйте сначала вычислить объём внутренней части куба — той области, где точки не попадают в приграничный слой.

Формат ввода
Два числа через пробел:
d — размерность пространства (целое, 1≤d≤1000);
ε — толщина слоя (вещественное, 0≤ε≤1).
Формат вывода
Вещественное число с точностью 10 знаков после запятой.

Пример
Ввод

2 0.1
Вывод
0.3600000000
"""

import sys


def main():
    """
    Пример ввода и вывода числа n, где -10^9 < n < 10^9:
    n = int(input())
    print(n)
    """
    d, eps = [float(i) for i in input().split()]
    d = int(d)
    layer_ratio = 1 - (1 - 2 * eps) ** d
    print(f"{layer_ratio:.10f}")


if __name__ == "__main__":
    main()
